polybassa/WyLight/cc3200/example/transceiver_mode/main.c
    // Remove all profiles
    lRetVal = sl_WlanProfileDel(0xFF);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    // If the device is not in station-mode, try putting it in staion-mode
    if (ROLE_STA != lMode)
    {
        if (ROLE_AP == lMode)
        {
            // If the device is in AP mode, we need to wait for this event
        	// before doing anything
            while(!IS_IP_ACQUIRED(g_ulStatus))
            {
#ifndef SL_PLATFORM_MULTI_THREADED
              _SlNonOsMainLoopTask();
#endif
            }
        }

        // Switch to STA role and restart
        lRetVal = sl_WlanSetMode(ROLE_STA);
        ASSERT_ON_ERROR(__LINE__, lRetVal);

        lRetVal = sl_Stop(SL_STOP_TIMEOUT);
        ASSERT_ON_ERROR(__LINE__, lRetVal);

        lRetVal = sl_Start(0, 0, 0);
        ASSERT_ON_ERROR(__LINE__, lRetVal);

        // Check if the device is in station again
        if (ROLE_STA != lRetVal)
        {
            // We don't want to proceed if the device is not coming up
        	// in station-mode
            return DEVICE_NOT_IN_STATION_MODE;
        }
    }

    //
    // Device in station-mode. Disconnect previous connection if any
    // return 0 if 'Disconnected done', negative number if already disconnected
    // Wait for 'disconnection' event if 0 is returned, Ignore other
    // return-codes
    //
    lRetVal = sl_WlanDisconnect();
    if(0 == lRetVal)
    {
        // Wait
        while(IS_CONNECTED(g_ulStatus))
        {
#ifndef SL_PLATFORM_MULTI_THREADED
              _SlNonOsMainLoopTask();
#endif
        }
    }

    // Enable DHCP client
    lRetVal = sl_NetCfgSet(SL_IPV4_STA_P2P_CL_DHCP_ENABLE,1,1,&ucVal);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    // Disable scan
    ucConfigOpt = SL_SCAN_POLICY(0);
    lRetVal = sl_WlanPolicySet(SL_POLICY_SCAN , ucConfigOpt, NULL, 0);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    // Set Tx power level for station mode
    // Number between 0-15, as dB offset from max power - 0 will set
    // maximum power
    ucPower = 0;
    lRetVal = sl_WlanSet(SL_WLAN_CFG_GENERAL_PARAM_ID, WLAN_GENERAL_PARAM_OPT_STA_TX_POWER, 1, (unsigned char *)&ucPower);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    // Set PM policy to normal
    lRetVal = sl_WlanPolicySet(SL_POLICY_PM , SL_NORMAL_POLICY, NULL, 0);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    lRetVal = sl_Stop(SL_STOP_TIMEOUT);
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    InitializeAppVariables();

    return lRetVal; // Success
}

//*****************************************************************************
//
//! Application startup display on UART
//!
//! \param  AppName
//!
//! \return none
//!
//*****************************************************************************
static void DisplayBanner(char * AppName)
{

  Report("\n\n\n\r");
  Report("\t\t *************************************************\n\r");
  Report("\t\t\t CC3200 %s Application       \n\r", AppName);
  Report("\t\t *************************************************\n\r");
  Report("\n\n\n\r");
}


//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void BoardInit(void)
{
/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
  //
  // Set vector table base
  //
#if defined(ccs)
    MAP_IntVTableBaseSet((unsigned long)&g_pfnVectors[0]);
#endif
#if defined(ewarm)
	MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif
#endif
  //
  // Enable Processor
  //
  MAP_IntMasterEnable();
  MAP_IntEnable(FAULT_SYSTICK);

  PRCMCC3200MCUInit();
}



//*****************************************************************************
//
//! UserInput
//!
//! This function
//!		1. Function for reading the user input.
//!
//! \return none
//
//*****************************************************************************
static UserIn UserInput()
{
    UserIn User;
    char acCmdStore[512];
    int iRetVal;
    int iRightInput = 0;


    do
    {
        UART_PRINT("\r\nOptions:\r\n1. Send packets.\r\n2. Collect statistics about received packets.\r\n");
        UART_PRINT("Enter the option to use: ");
        iRetVal = GetCmd(acCmdStore, sizeof(acCmdStore));
        if(iRetVal == 0)
        {
          //
          // No input. Just an enter pressed probably. Display a prompt.
          //
          UART_PRINT("\n\n\rEnter Valid Input.");
          iRightInput = 0;
        }
        else
        {
          User.choice = (int)strtoul(acCmdStore,0,10);
          if(User.choice != 1 && User.choice != 2)
          {
            UART_PRINT("\n\n\rWrong Input");
            iRightInput = 0;
          }
          else
          {
            iRightInput = 1;
          }
        }
        UART_PRINT("\n\r");
    }while(!iRightInput);



    if (User.choice == 1)
    {
        /*channel*/
        do
        {
            UART_PRINT("Enter the channel to use[1:13]: ");
            iRetVal = GetCmd(acCmdStore, sizeof(acCmdStore));
            if(iRetVal == 0)
            {
              //
              // No input. Just an enter pressed probably. Display a prompt.
              //
              UART_PRINT("\n\rEnter Valid Input.");
              iRightInput = 0;
            }
            else
            {
              User.channel = (int)strtoul(acCmdStore,0,10);
              if(User.channel <= 0 || User.channel > 13)
              {
                UART_PRINT("\n\rWrong Input");
                iRightInput = 0;
              }
              else
              {
                iRightInput = 1;
              }
            }

            UART_PRINT("\r\n");
        }while(!iRightInput);

        /*Number of packets*/
        do
        {
            UART_PRINT("Enter the number of packets to send : ");
            iRetVal = GetCmd(acCmdStore, sizeof(acCmdStore));
            if(iRetVal == 0)
            {
              //
              // No input. Just an enter pressed probably. Display a prompt.
              //
              UART_PRINT("\n\rEnter Valid Input.");
              iRightInput = 0;
            }
            else
            {
              User.packets = (int)strtoul(acCmdStore,0,10);
              if(User.packets <= 0 && User.packets > 65535)
              {
                UART_PRINT("\n\rWrong Input");
                iRightInput = 0;
              }
              else
              {
                iRightInput = 1;
              }
            }
            UART_PRINT("\r\n");
        }while(!iRightInput);

        /*Rate*/
        do
        {
            UART_PRINT("Enter the rate: ");
            iRetVal = GetCmd(acCmdStore, sizeof(acCmdStore));
            if(iRetVal == 0)
            {
                //
                // No input. Just an enter pressed probably. Display a prompt.
                //
                UART_PRINT("\n\rEnter Valid Input.");
                iRightInput = 0;
            }
            else
            {
                User.rate = (SlRateIndex_e)strtoul(acCmdStore,0,10);
                if(User.rate < RATE_1M || User.rate > RATE_MCS_7)
                {
                    UART_PRINT("\n\rWrong Input");
                    iRightInput = 0;
                }
                else
                {
                    iRightInput = 1;
                }
            }

            UART_PRINT("\r\n");
        }while(!iRightInput);
        /* Tx Power level */
        do
        {
            UART_PRINT("Enter the Tx power[0:15]: ");
            iRetVal = GetCmd(acCmdStore, sizeof(acCmdStore));
            if(iRetVal == 0)
            {
                //
                // No input. Just an enter pressed probably. Display a prompt.
                //
                UART_PRINT("\n\rEnter Valid Input.");
                iRightInput = 0;
            }
            else
            {
                User.Txpower = (int)strtoul(acCmdStore,0,10);
                if(User.Txpower < 0 || User.Txpower > 15)
                {
                    UART_PRINT("\n\rWrong Input");
                    iRightInput = 0;
                }
                else
                {
                    iRightInput = 1;
                }
            }

            UART_PRINT("\r\n");
        }while(!iRightInput);
    }

    return User;
}




//*****************************************************************************
//
//! Tx_continuous
//!
//! This function
//!		1. Function for sending out pinging data on the
//!                channel given by the user.
//!
//! \return none
//
//*****************************************************************************
static int Tx_continuous(int iChannel,SlRateIndex_e rate,int iNumberOfPackets,int iTxPowerLevel,long dIntervalMiliSec)
{
    int iSoc;
    long lRetVal = -1;
    long ulIndex;

    iSoc = sl_Socket(SL_AF_RF,SL_SOCK_RAW,iChannel);
    if(iSoc < 0)
    {
	  UART_PRINT("Failed to create socket\r\n");
	  ASSERT_ON_ERROR(__LINE__, iSoc);
    }

    UART_PRINT("Transmitting data...\r\n");
    for(ulIndex = 0 ; ulIndex < iNumberOfPackets ; ulIndex++)
    {
    	lRetVal = sl_Send(iSoc,RawData_Ping,sizeof(RawData_Ping),SL_RAW_RF_TX_PARAMS(iChannel,  rate, iTxPowerLevel, PREAMBLE));
        if(lRetVal < 0)
        {
        	UART_PRINT("Transmition Failed!\r\n");
        	sl_Close(iSoc);
        	ASSERT_ON_ERROR(__LINE__, lRetVal);
        }
        //Sleep(dIntervalMiliSec);
        MAP_UtilsDelay(4000000);
    }

    lRetVal = sl_Close(iSoc);
    ASSERT_ON_ERROR(__LINE__, lRetVal);
    UART_PRINT("Transmission complete.\r\n");
    return SUCCESS;
}

//*****************************************************************************
//
//! RxStatisticsCollect
//!
//! This function
//!		1. Function for performing the statistics by listening on the
//!                channel given by the user.
//!
//! \return none
//
//*****************************************************************************
static int RxStatisticsCollect()
{
	int iSoc;
	char acBuffer[1500];
	SlGetRxStatResponse_t rxStatResp;
    //char cChar;
	int iIndex;
    int iChannel;
    long lRetVal = -1;
    int iRightInput = 0;
    char acCmdStore[512];
    struct SlTimeval_t timeval;

	timeval.tv_sec =  0;             // Seconds
	timeval.tv_usec = 20000;         // Microseconds. 10000 microseconds resoultion


    //
    //Clear all fields to defaults
    //
    rxStatResp.ReceivedValidPacketsNumber = 0;
    rxStatResp.ReceivedFcsErrorPacketsNumber = 0;
    rxStatResp.ReceivedPlcpErrorPacketsNumber = 0;
    rxStatResp.AvarageMgMntRssi = 0;
    rxStatResp.AvarageDataCtrlRssi = 0;
    for(iIndex = 0 ; iIndex < SIZE_OF_RSSI_HISTOGRAM ; iIndex++)
	{
		rxStatResp.RssiHistogram[iIndex] = 0;
	}
	for(iIndex = 0 ; iIndex < NUM_OF_RATE_INDEXES ; iIndex++)
	{
		rxStatResp.RateHistogram[iIndex] = 0;
	}
    rxStatResp.GetTimeStamp = 0;
    rxStatResp.StartTimeStamp = 0;

    //
    //Prompt the user for channel number
    //
    do
    {
      UART_PRINT("\n\rEnter the channel to listen[1-13]:");
      //
      // Wait to receive a character over UART
      //
      lRetVal = GetCmd(acCmdStore, sizeof(acCmdStore));
      if(lRetVal == 0)
      {
        //
        // No input. Just an enter pressed probably. Display a prompt.
        //
        UART_PRINT("\n\rEnter Valid Input.");
        iRightInput = 0;
      }
      else
      {
        iChannel = (int)strtoul(acCmdStore,0,10);
        if(iChannel <= 0 || iChannel > 13)
        {
          UART_PRINT("\n\rWrong Input");
          iRightInput = 0;
        }
        else
        {
          iRightInput = 1;
        }
      }

    }while(!iRightInput);


    UART_PRINT("\n\rPress any key to start collecting statistics...");

	//
	// Wait to receive a character over UART
	//
	MAP_UARTCharGet(CONSOLE);

	//
	//Start Rx statistics collection
	//
	lRetVal = sl_WlanRxStatStart();
	ASSERT_ON_ERROR(__LINE__, lRetVal);

	//
	//Open Socket on the channel to listen
    //
    iSoc = sl_Socket(SL_AF_RF,SL_SOCK_RAW,iChannel);
    if( iSoc < 0 )
    {
      // error
      UART_PRINT("\n\rFailed to create socket...");
      ASSERT_ON_ERROR(__LINE__, iSoc);
    }

    lRetVal = sl_SetSockOpt(iSoc,SL_SOL_SOCKET,SL_SO_RCVTIMEO, &timeval, sizeof(timeval));    // Enable receive timeout
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    lRetVal = sl_Recv(iSoc,acBuffer,1470,0);

    if(lRetVal < 0)
    {
    	//error
    	UART_PRINT("\n\rFailed to get statistics data!");
    	sl_Close(iSoc);
    	ASSERT_ON_ERROR(__LINE__, lRetVal);
    }
	UART_PRINT("\n\rPress any key to stop and display the statistics...");

    //
    // Wait to receive a character over UART
    //
    MAP_UARTCharGet(CONSOLE);

    //
    //Get the Statistics collected in this time window
    //
    lRetVal = sl_WlanRxStatGet(&rxStatResp,0);
    if(lRetVal < 0)
    {
    	//error
    	UART_PRINT("\n\rFailed to get statistics data!");
    	sl_Close(iSoc);
    	ASSERT_ON_ERROR(__LINE__, lRetVal);
    }

    //
    //Printing the collected statistics
    //
    UART_PRINT("\n\n\n\r\t\t=========================================== \n \
               \r");
    UART_PRINT("\n\r\t\t\t\tRx Statistics \n\r");
    UART_PRINT("\t\t=========================================== \n\r");

    UART_PRINT("\n\n\rThe data sampled over %ld microsec\n\n\r",	\
               (unsigned int)(rxStatResp.GetTimeStamp -
                              rxStatResp.StartTimeStamp));

    UART_PRINT("Number of Valid Packets Received:  %d\n\r",
    						rxStatResp.ReceivedValidPacketsNumber);
	UART_PRINT("Number of Packets Received Packets with FCS: %d\n\r",
                   rxStatResp.ReceivedFcsErrorPacketsNumber);
	UART_PRINT("Number of Packets Received Packets with PLCP: %d\n\n\r",   \
                   rxStatResp.ReceivedPlcpErrorPacketsNumber);
	UART_PRINT("Average Rssi for management packets: %d\
                    \n\rAverage Rssi for other packets: %d\n\r",
                   rxStatResp.AvarageMgMntRssi,rxStatResp.AvarageDataCtrlRssi);
	for(iIndex = 0 ; iIndex < SIZE_OF_RSSI_HISTOGRAM ; iIndex++)
	{
          UART_PRINT("Number of packets with RSSI in range %d dbm - %d dbm: %d\n\r",
                     ((-40+(-8*iIndex))),((-40+(-8*(iIndex+1)))+1),
                       rxStatResp.RssiHistogram[iIndex]);
	}
	UART_PRINT("\n\r");

    //for(iIndex = 0 ; iIndex < NUM_OF_RATE_INDEXES ; iIndex++)
	iIndex = 0;
    {
      UART_PRINT("Number of Packets with Rate 1Mbps  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate 2Mbps  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate 5.5Mbps  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate 11Mbps  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate 6Mbps  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate 9Mbps  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate 12Mbps  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate 18Mbps  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate 24Mbps  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate 36Mbps  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate 48Mbps  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate 54Mbps  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate MCS_0  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate MCS_1  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate MCS_2  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate MCS_3  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate MCS_4  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate MCS_5  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate MCS_6  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
      UART_PRINT("Number of Packets with Rate MCS_7  : %d\n\r",
                 rxStatResp.RateHistogram[iIndex++]);
 	}

	//
    //Stop Rx statistics collection
    //
    lRetVal = sl_WlanRxStatStop();
    ASSERT_ON_ERROR(__LINE__, lRetVal);

    //
    //Close the socket
    //
    lRetVal = sl_Close(iSoc);
    ASSERT_ON_ERROR(__LINE__, lRetVal);
    return SUCCESS;
}

//*****************************************************************************
//
//! main
//!
//! This function
//!		1. Main function for the application.
//!		2. Make sure there is no profile before activating this test.
//!     3. This test is not optimized for current consumption at this stage.
//!
//! \return none
//
//*****************************************************************************

