polybassa/WyLight/cc3200/example/transceiver_mode/main.c
int main()
{
  UserIn User;
  int iFlag = 1;
  long lRetVal = -1;
  char cChar;
  unsigned char policyVal;
  //
  // Initialize Board configuration
  //
  BoardInit();
  //
  //
  //Pin muxing
  //
  PinMuxConfig();
  // Configuring UART
  //
  InitTerm();
  DisplayBanner(APPLICATION_NAME);

  InitializeAppVariables();

  //
  // Following function configure the device to default state by cleaning
  // the persistent settings stored in NVMEM (viz. connection profiles &
  // policies, power policy etc)
  //
  // Applications may choose to skip this step if the developer is sure
  // that the device is in its default state at start of applicaton
  //
  // Note that all profiles and persistent settings that were done on the
  // device will be lost
  //
  lRetVal = ConfigureSimpleLinkToDefaultState();
  if(lRetVal < 0)
  {
	if (DEVICE_NOT_IN_STATION_MODE == lRetVal)
	  UART_PRINT("Failed to configure the device in its default state \n\r");
	  LOOP_FOREVER(__LINE__);
  }

  UART_PRINT("Device is configured in default state \n\r");

  CLR_STATUS_BIT_ALL(g_ulStatus);

  //
  // Assumption is that the device is configured in station mode already
  // and it is in its default state
  //
  lRetVal = sl_Start(0, 0, 0);
  if (lRetVal < 0 || ROLE_STA != lRetVal)
  {
	UART_PRINT("Failed to start the device \n\r");
	LOOP_FOREVER(__LINE__);
  }

  UART_PRINT("Device started as STATION \n\r");

  //
  // reset all network policies
  //
  lRetVal = sl_WlanPolicySet(  SL_POLICY_CONNECTION,
                  SL_CONNECTION_POLICY(0,0,0,0,0),
                  &policyVal,
                  1 /*PolicyValLen*/);
  if (lRetVal < 0)
  {
  	UART_PRINT("Failed to set policy \n\r");
  	LOOP_FOREVER(__LINE__);
  }

  while (iFlag)
  {
    User = UserInput();

    switch(User.choice)
    {
      case(1):

      /*******An example of Tx continuous on user selected channel, rate 11,
       * user selected number of packets, minimal delay between packets*******/
		lRetVal = Tx_continuous(User.channel,User.rate,User.packets, \
				                 User.Txpower,0);
        if(lRetVal < 0)
        {
        	UART_PRINT("Error during transmission");
        	LOOP_FOREVER(__LINE__);
        }
          break;
      case(2):

       /******An example of Rx statistics using user selected channel *******/
		lRetVal = RxStatisticsCollect();
      if(lRetVal < 0)
	  {
		UART_PRINT("Error while collecting statistics");
		LOOP_FOREVER(__LINE__);
	  }
          break;
    }

    UART_PRINT("\n\rEnter \"1\" to restart or \"0\" to quit: ");
    //
    // Wait to receive a character over UART
    //
    cChar = MAP_UARTCharGet(CONSOLE);
    //
    // Echo the received character
    //
    MAP_UARTCharPut(CONSOLE, cChar);
    UART_PRINT("\n\r");
    iFlag = atoi(&cChar);
  }
  UART_PRINT("\r\nEnding the application....");
  //
  // power off network processor
  //
  sl_Stop(SL_STOP_TIMEOUT);

  LOOP_FOREVER(__LINE__);

}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
